import { motion } from "framer-motion";
import { useState } from "react";
import { useNavigate } from "react-router-dom"; 
import "./Memories.css";
import sssImage from "../images/ss.jpeg";
import ppImage from "../images/pp.jpeg";
import cpImage from "../images/cp.JPG";

const memories = [
  { title: "승환이랑 첫 만남 💗", text: "MT 처음 봤을 때부터 눈에 자꾸 신경 쓰이고 귀엽다는 걸 느껴졌다. 너는내가 이런 말 하면 별것 아닌 것처럼 생각하겠지만 넌 진짜 내 눈에 엄청 귀엽고 보면 볼수록 갖고 싶은 마음이 생겼다. 인생에 딱 한 번도 느껴본 적이 없는 마음으로 그냥 멀리서 봐도 행복했다. 평소에 집 학교 학교 집 밖에 안 가고 도서관 정보관에서 한 번도 공부해본 적 없었던 나는 그 애를 보기 위해서 자주 정보관에서 기다렸다. 운이 좋은지 모르겠지만 처음으로 기다렸던 날부터 그 애가 정보관에서 공부하고 있었다. 아무 관계 아니었는데도 그냥 보는 거만으로 행복해서 나는 내 첫사랑을 만났다고 그때 깨달았다. 말 걸기 용기도 없고 이런 경험 처음이라서 친해지려고 노력할 때 시간이 걸렸다. 우주가 내편에 있었던 것 같다. 같은 수업이라서 말 먼저 걸기 위해서 기회가 생겼다. 사랑은 타이밍이 중요하다는 친구들의 의견으로 나는 타이밍 맞게 노력했던 것 같다. 짝사랑하고 있을 때 슬픈 시간도 많았고 행복한 시간도 많았다. 그때 그 애가 나한테 인사하는 거만으로 나는 세상에 제일 행복한 사람이었다. 나도 왜 이렇게까지 빠졌는지 스스로 이해가 안 됐다. 웃을 때 엄청 예쁘게 웃으면서 하는 행동 하나하나씩이 너무 귀여웠다. 그 애를 보기 위해서 동아리 행사마다 갔었고 수업 끝날 때마다 학교 주변에 돌아다녔다. 그래도 진짜 사랑이 나보다. 그때는 그 애한테 내가 아무 존제도 아니다 그냥 지나가는 사람이다 이런 생각 들면 진짜 슬펐고 울었던 본 적이 있다.짝사랑 포기하려고 노력했던 시간이 20번 넘었다. 그래도 드디어 사랑은 꼭 받아야 사랑이 아니라서 결과가 어떻게 되든 가슴이 아프든 계속 사랑하기로 했다. 용기 내서 말도 여러 번 걸고 그랬다. 처음엔 답장 안 하거나 엄청 늦어서 나한테 관심이 없는 게 느꼈다. 너무 슬퍼서 또 짝사랑 그만 하려고 했지만 사랑하는 마음이 커서 그런지 성공 못 했다. 그래도 내 노력과 마음이 진심이라서 그런지 좋은 일들이 생긴 것 같다. 드디어 낌씅환 내 남자다❤️‍🔥", img: sssImage },
  { title: "승환이랑 좋은 추억들 💝", text: "승환이랑 친구 되려고 노력했고 멀리서 보고 있다가 승환이 성격이 내성적이고 소심한 사람이고 부끄러움도 많은 것 같다고 생각했다. 그래도 내가 이 관계를 시작 안 하면 아무 일이 안 생길 거라고 생각해서 인생 모든 용기로 고연전 가자고 했다. 애가 불편해서 그런지 내 초대를 바로 대답 안하고 말 돌리고 있었지만 용기내서 또 같이 가자고 했다. 그때 마음이 좋은 애라서 그런지 내 말을 받아졌다. 나는 그때 대학 입학할 때부터 기분이 좋고 행복했다. 인생에 그렇게 기뻐본 적이 없었고 그 애 만나기 전까지 너무 설렜다. 그때 처음이라서 승환이 어색했겠 지만 나는 열심히 말 걸고 설렌 마음으로 정신이 없었다. 처음으로 승환이 허리를 만질 수 있는 그 순간을 잊지 못 하고 고연전 너무 고마웠다. 사람이 원래 욕심이 있어서 그런지 나는 친구만으로 만족하지 않았다. 끝까지 가보자고 같이 공부하자고도 했고 여러가지 이유로 약속을 잡았다. 내가 그랬는데도 애가 나한 테 거절해 본 적이 없었다. 그때 순간들이 진짜 기뻤고 행복했다. 그랬다가 더 알면 알수록 좋아하게 되면서 빠져왔는 순간 승환이도 내 마음을 느껴서 그런지 말 꺼내게 되었다. 그 자리 그 순간 그 시간이 평생 잊을 수 없는 추억들이다. 솔직히 처음엔 승환이 날 진짜 좋아해서 아니라 원래 착한 애라서 내가 좋아하는 걸 알고 미안한 마음으로 받아주는 건가 라고 생각했지만  그래도 나는 내 옆에 있어주는 것도 너무 고맙고 내가 사랑하는 거만으로 충분한 것 같아서 끝까지 사랑하려고 결심했다 ❤️‍🩹", img: ppImage },
  { title: "승환이랑 평생 가고싶다💞", text: "승환이 진짜 착하고 좋은 남자다. 내 삐진 성격도 참아주고 내 약점도 좋은 눈으로 봐주고 항상 내가 좋아하는 거만 우선으로 해줬다. 진짜 고맙고 가끔은 미안한 마음이 있다. 승환이 내 이상형이고 존중한 마음으로 사랑하고 있어서 나는 솔직히 승환이처럼 되고 싶다. 마음도 착하고 똑똑하고 성격도 좋고 예의도 바르고 귀엽고 그런 애를 나는 시간이 가면 갈 수록 준경하는 마음부터 좋아하는 마음 그리고 사랑하는 마음까지 커졌다. 사랑은 운명도 중요하지만 나는 그 운명이 사람이 만드는 거라고 믿는다. 그래서 어떤 일이나 아무 어려움이나 문제가 생길 더라도 승환이 손을 꽉 잡고 안 놓칠 것이다. 내 인생의 처음이고 마지막 사랑이 될 김승환이 많이 사랑해 ❤️‍ 너만 변한 거 아니면 난 너의 손을 놓칠 생각이 전혀 없으니까 끝까지 오래 오래 사랑하고 싶어. 내가 아이돌 좋아하는 거 맞는데 그 게 널 만나기 전이야. 널 처음 봤을 때부터 내 인생의 유일하고 하나뿐인 남자가 너야 💝 이렇게 예쁘고 행복한 20대도 너랑 같이 지내고 싶고 결혼식때 너의 옆에 서있을 여자도 나만 되고 싶고 돈 벌는 40대도 너랑 같이 보내고 싶고 늙을 때까지 옆에서 같이 있고 싶어. 오래 오래 살면서 죽을 때도 하늘에 별들을 같이 보면서 떠나고 싶어. 너는 진짜 내 소원이었으니까 엄청 아끼면서 아무도 널 못 만지게 내가 지켜주면서 사랑할거야 💞💖. 진짜 많이 많이 사랑해 우리 승환이❤️", img: cpImage }
];

const Memories = () => {
  const [expandedIndex, setExpandedIndex] = useState(null);
  const navigate = useNavigate();

  return (
    <div className="memories-page">
      <div className="memories-container">
        {memories.map((memory, index) => (
          <motion.div
            className={`memory ${expandedIndex === index ? "expanded" : ""}`}
            key={index}
            whileHover={{ scale: 1.05 }}
            transition={{ duration: 0.3 }}
          >
            <h2>{memory.title}</h2>
            <button onClick={() => setExpandedIndex(index === expandedIndex ? null : index)}>
              {expandedIndex === index ? "Hide" : "See More"}
            </button>

            {/* Expanded Memory Details */}
            {expandedIndex === index && (
              <motion.div
                className="memory-details"
                initial={{ opacity: 0, x: -50 }}
                animate={{ opacity: 1, x: 0 }}
                transition={{ duration: 0.3 }}
              >
                <div className="memory-arrow"></div> 
                <img src={memory.img} alt={memory.title} />
                <p>{memory.text}</p>
              </motion.div>
            )}
          </motion.div>
        ))}
      </div>

      <button className="next-button" onClick={() => navigate("/proposal")}>Next 💍</button>
    </div>
  );
};

export default Memories;
